---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ColorFillFailures.OnlyOneColorFillNonPlan
source: html/e7c9d706-b191-c12a-b2f3-d8ef96e456cc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColorFillFailures.OnlyOneColorFillNonPlan Property

A Color Fill Legend can only be placed in a Floor Plan View or a Section View.

## Syntax (C#)
```csharp
public static FailureDefinitionId OnlyOneColorFillNonPlan { get; }
```